#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0beea11464aa98826]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f80253ea0c5c64d7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0afd99b5b90a58de7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04ba76798d1b5dffb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-092263c8b0ef10131]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0822e5d2833116c8a]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0dad8538e65e1233a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03efeb2415ef9cb40]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05635e459d9541e98]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08fdd9013a65b53a5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f43fd34dbada9d8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04ba76798d1b5dffb1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-003a06f6f3fd7142b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05efd60411735ee8b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0696b7557f64cc366]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03efeb2415ef9cb401080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.example-dynamodb-table will be created
  + resource "aws_dynamodb_table" "example-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "GameScores"
      + range_key        = "GameTitle"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "GameTitle"
          + type = "S"
        }
      + attribute {
          + name = "TopScore"
          + type = "N"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "GameTitle"
          + name               = "GameTitleIndex"
          + non_key_attributes = [
              + "UserId",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "TopScore"
          + read_capacity      = 10
          + write_capacity     = 10
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @pinaki-m, Action: `pull_request`*